IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_lfu_regs.xml
<module id="LFU_REGS" HW_revision="" description="LFU Registers">
	<register id="LFUConfig" width="32" page="1" offset="0x0" internal="0" description="LFU configuration Register">
		<bitfield id="LFU_CPU" description="SW configuration to implement LFU" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LFU_CLA1" description="SW configuration to implement LFU" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PieVectorSwap" description="Swap of pie vector table" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="LS01Swap" description="Swap LS0 and LS1 memory" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="LFUStatus" width="32" page="1" offset="0x2" internal="0" description="LFU Configuration Status Register">
		<bitfield id="PieVectorSwap" description="Indicate the status of PieVectorSwap" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="LS01Swap" description="Indicate the status of LS0/LS1 memory swap" begin="16" end="16" width="1" rwaccess="R"/>
	</register>
	<register id="SWConfig1_SYSRSn" width="32" page="1" offset="0x10" internal="0" description="Spare registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SWConfig2_SYSRSn" width="32" page="1" offset="0x12" internal="0" description="Spare registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SWConfig1_XRSn" width="32" page="1" offset="0x14" internal="0" description="Spare registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SWConfig2_XRSn" width="32" page="1" offset="0x16" internal="0" description="Spare registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SWConfig1_PORESETn" width="32" page="1" offset="0x18" internal="0" description="Spare registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SWConfig2_PORESETn" width="32" page="1" offset="0x1a" internal="0" description="Spare registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="LFU_LOCK" width="32" page="1" offset="0x1c" internal="0" description="LFU Lock Configuration">
		<bitfield id="LFUConfig" description="Register lock configuration" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_SYSRSn" description="Register lock configuration" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_SYSRSn" description="Register lock configuration" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_XRSn" description="Register lock configuration" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_XRSn" description="Register lock configuration" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_PORESETn" description="Register lock configuration" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_PORESETn" description="Register lock configuration" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="LFU_COMMIT" width="32" page="1" offset="0x1e" internal="0" description="LFU Commit Configuration">
		<bitfield id="LFUConfig" description="Register commit configuration" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_SYSRSn" description="Register commit configuration" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_SYSRSn" description="Register commit configuration" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_XRSn" description="Register commit configuration" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_XRSn" description="Register commit configuration" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig1_PORESETn" description="Register commit configuration" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SWConfig2_PORESETn" description="Register commit configuration" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
</module>
